[
  {
    "id": "conv_001",
    "scenario": "Product inquiry -> full information -> registration intent",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "Hola, vi un anuncio y quiero saber como funciona lo de multiplicar el capital."
      },
      {
        "role": "agent",
        "content": "¡Hola! Claro que sí, con gusto te explico. Mi nombre es [BOT_NAME], tu asistente de TAG Markets. Para darte la mejor información, ¿me podrías decir cuánto tiempo llevas haciendo trading?"
      },
      {
        "role": "customer",
        "content": "como 1 año ya"
      },
      {
        "role": "agent",
        "content": "Perfecto. Nuestras Cuentas Apalancadas X12 están diseñadas para traders como tú. Te permiten operar con un capital 12 veces mayor al que depositas.\n\nPor ejemplo, si depositas 200 USD, podrás operar con 2,400 USD. La única regla clave es no perder más del 10% del balance total de la cuenta apalancada para evitar su cierre (es decir, el 10% de 2,400 USD).\n\nAquí tienes más detalles:\n- *Multiplicación de Saldo:* Incrementa tu saldo 12 veces.\n- *Retiros:* Puedes retirar ganancias desde el día 1. Tu depósito inicial se puede retirar después de 30 días.\n- *Comisión Fija:* $1 por 0.1 lote.\n- *Sin Exámenes:* La cuenta se entrega de inmediato, lista para operar.\n- *Ganancias 100% Tuyas:* No hay reparto de profits."
      },
      {
        "role": "customer",
        "content": "suena bien, y cual es el deposito minimo?"
      },
      {
        "role": "agent",
        "content": "Puedes empezar desde 100 USD, que se convierten en una cuenta de 1,200 USD para operar. También tenemos de 200 para 2,400 y de 500 para 6,000."
      },
      {
        "role": "customer",
        "content": "Ok me interesa la de 100 para probar. Como empiezo?"
      },
      {
        "role": "agent",
        "content": "¡Excelente! El primer paso es registrarte y verificar tus documentos en este enlace: [LINK_REGISTRO]. Avísame cuando lo hayas completado para guiarte en el siguiente paso."
      }
    ],
    "outcome": "success",
    "notes": "Standard happy path where the user is experienced and converts after receiving information."
  },
  {
    "id": "conv_002",
    "scenario": "Existing user asking about withdrawals",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "Hola, ya tengo mi cuenta y tuve algunas ganancias. Como hago para retirar?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Felicitaciones por tus ganancias. El proceso es muy sencillo. Debes iniciar sesión en tu portal de cliente, ir a la sección 'Amplify' y seleccionar la opción de retiro. Aquí tienes una guía detallada con el paso a paso: [LINK_GUIA_RETIROS]"
      },
      {
        "role": "customer",
        "content": "ok gracias. y cuanto tarda en llegar el dinero?"
      },
      {
        "role": "agent",
        "content": "Los retiros a billeteras de criptomonedas se procesan el mismo día. Si es por transferencia bancaria, puede tardar entre 24 y 48 horas hábiles."
      },
      {
        "role": "customer",
        "content": "perfecto, gracias"
      }
    ],
    "outcome": "success",
    "notes": "User already has an account and just needs procedural information."
  },
  {
    "id": "conv_003",
    "scenario": "Quick question about drawdown rule",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "una pregunta, si mi cuenta de 6000 sube a 7000, el 10% de perdida se calcula sobre los 7000?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Muy buena pregunta. No, el drawdown es estático. Se calcula siempre sobre el balance inicial de la cuenta apalancada. En tu ejemplo de una cuenta de $6,000, el límite de pérdida siempre será de $600. Así que si tu cuenta sube a $7,000, no se cerrará a menos que el balance total baje de $5,400."
      },
      {
        "role": "customer",
        "content": "ah ya entendi, super claro gracias"
      }
    ],
    "outcome": "success",
    "notes": "User needs clarification on a specific rule, which is a common and important query."
  },
  {
    "id": "conv_004",
    "scenario": "Beginner user needing academy redirect",
    "category": "deviation",
    "messages": [
      {
        "role": "customer",
        "content": "Hola quiero la cuenta apalancada"
      },
      {
        "role": "agent",
        "content": "¡Hola! Te saluda [BOT_NAME] de TAG Markets. Con gusto te ayudo. Antes de darte los detalles, ¿me podrías contar qué experiencia tienes en trading?"
      },
      {
        "role": "customer",
        "content": "no ninguna, quiero aprender y ganar dinero"
      },
      {
        "role": "agent",
        "content": "Entiendo perfectamente. Nuestras cuentas apalancadas son un producto de alto riesgo y están diseñadas para traders con experiencia que ya tienen una estrategia definida. Operar sin conocimiento puede llevar a pérdidas rápidas."
      },
      {
        "role": "agent",
        "content": "Para personas que están empezando como tú, recomendamos formarse primero. Tenemos una alianza con Premium Academy de David Guerrero, donde puedes aprender desde cero. ¿Te gustaría que te comparta más información sobre la academia?"
      },
      {
        "role": "customer",
        "content": "ah ok... bueno si, mandame la info de la academia"
      }
    ],
    "outcome": "redirect",
    "notes": "Bot correctly identifies an inexperienced user and redirects them to an appropriate educational resource instead of selling the high-risk product."
  },
  {
    "id": "conv_005",
    "scenario": "Deposit/technical issues requiring support",
    "category": "deviation",
    "messages": [
      {
        "role": "customer",
        "content": "hola buenas, hice un deposito hace como 2 horas con mi tarjeta y todavia no me aparece el saldo en la wallet"
      },
      {
        "role": "agent",
        "content": "Hola, entiendo tu preocupación. A veces las transacciones con tarjeta pueden tener una pequeña demora en la verificación. Para poder revisar el estado de tu depósito, ¿me podrías proporcionar el correo electrónico con el que te registraste y, si es posible, una captura del comprobante de pago?"
      },
      {
        "role": "customer",
        "content": "mi correo es traderpro_123@email.com. aqui esta la foto"
      },
      {
        "role": "agent",
        "content": "Muchas gracias. Ya estoy enviando tu caso al equipo de soporte para que lo revisen con prioridad. Te pido un poco de paciencia, en breve te darán una actualización por este medio o a tu correo."
      },
      {
        "role": "customer",
        "content": "ok espero gracias"
      }
    ],
    "outcome": "escalation",
    "notes": "User has a deposit issue. The bot collects necessary information and escalates to the human support team."
  },
  {
    "id": "conv_006",
    "scenario": "Confused about promotions/bonuses",
    "category": "deviation",
    "messages": [
      {
        "role": "customer",
        "content": "vi en instagram que daban una cuenta gratis, como la reclamo?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Gracias por tu interés en nuestras promociones. Generalmente, nuestras 'cuentas bono' se otorgan al activar una cuenta principal. Por ejemplo, al depositar para una cuenta de $100 (que se amplifica a $1,200), recibes una cuenta bono adicional para operar."
      },
      {
        "role": "customer",
        "content": "pero el anuncio decia gratis sin deposito"
      },
      {
        "role": "agent",
        "content": "Comprendo la confusión. A veces tenemos diferentes campañas activas. Para darte la información correcta, ¿recuerdas algún detalle más del anuncio o tienes un código de promoción? Algunas campañas muy específicas para obtener una cuenta sin depósito previo requieren que te registres y abras un ticket en la sección de 'Apoyo' de tu portal para que el equipo de soporte la active manualmente."
      },
      {
        "role": "customer",
        "content": "ahh ok, no tengo codigo. entonces me registro y pido por ticket?"
      },
      {
        "role": "agent",
        "content": "Exacto. Regístrate primero, completa la verificación y luego crea un ticket en la sección 'Apoyo' solicitando la activación de la cuenta de la promoción que viste. El equipo de soporte revisará tu caso."
      }
    ],
    "outcome": "success",
    "notes": "User is confused about a promotion. Bot clarifies the common bonus structure and provides the correct procedure for special cases."
  },
  {
    "id": "conv_007",
    "scenario": "Off-topic/wrong number",
    "category": "edge_case",
    "messages": [
      {
        "role": "customer",
        "content": "Hola primo, ya tienes listo lo del asado para el sabado?"
      },
      {
        "role": "agent",
        "content": "Hola, te comunicas con TAG Markets, una plataforma de trading. Creo que te has equivocado de número. ¡Que tengas un buen día!"
      }
    ],
    "outcome": "dropout",
    "notes": "Simple wrong number scenario. Bot identifies it and politely closes the conversation."
  },
  {
    "id": "conv_008",
    "scenario": "Aggressive/impatient customer",
    "category": "edge_case",
    "messages": [
      {
        "role": "customer",
        "content": "quiero saber de la cuenta x12 ya"
      },
      {
        "role": "agent",
        "content": "¡Hola! Claro que sí. Con gusto te doy la información de la cuenta apalancada X12. ¿Tienes experiencia en trading?"
      },
      {
        "role": "customer",
        "content": "si si tengo, no me hagas perder el tiempo, solo dime cuanto es lo minimo y cuales son las reglas, rapido"
      },
      {
        "role": "agent",
        "content": "Entendido. El depósito mínimo es de $100 para una cuenta de $1,200. La regla principal es no perder más del 10% del balance total de la cuenta ($120 en este caso). Puedes retirar ganancias desde el primer día y no hay reparto de profits. ¿Deseas el enlace para registrarte?"
      },
      {
        "role": "customer",
        "content": "ok si pasamelo"
      }
    ],
    "outcome": "success",
    "notes": "Bot handles an impatient user by being direct and providing the key information requested without the full script."
  },
  {
    "id": "conv_009",
    "scenario": "Multi-turn clarification needed on static drawdown",
    "category": "edge_case",
    "messages": [
      {
        "role": "customer",
        "content": "no entiendo bien lo de la perdida"
      },
      {
        "role": "agent",
        "content": "Claro, te lo explico. La regla es que el balance de tu cuenta apalancada no debe bajar más del 10% de su valor inicial. Si tienes una cuenta de $6,000, el 10% son $600. Tu cuenta se cierra si el balance total llega a $5,400."
      },
      {
        "role": "customer",
        "content": "ok, pero si gano 1000 y tengo 7000, entonces puedo perder 1600?"
      },
      {
        "role": "agent",
        "content": "Exactamente. Si tu balance sube a $7,000, el 'piso' de la cuenta sigue siendo $5,400. Podrías perder los $1,000 que ganaste más los $600 de margen inicial antes de que la cuenta se cierre. A eso nos referimos con que el drawdown es 'estático'."
      },
      {
        "role": "customer",
        "content": "y si pierdo 100 un dia y 200 otro dia, se va sumando?"
      },
      {
        "role": "agent",
        "content": "Sí, es una pérdida acumulada. No importa si pierdes el 10% en una sola operación o en varias a lo largo de muchos días. Lo que importa es que el balance total nunca caiga por debajo de ese 90% del capital inicial."
      },
      {
        "role": "customer",
        "content": "ahora si quedo claro. gracias"
      }
    ],
    "outcome": "success",
    "notes": "User requires multiple explanations of the same concept. The bot breaks it down with examples."
  },
  {
    "id": "conv_010",
    "scenario": "Copy trading questions",
    "category": "complex",
    "messages": [
      {
        "role": "customer",
        "content": "Hola, me interesa la cuenta pero quiero saber si tienen copy trading. Yo no se operar mucho"
      },
      {
        "role": "agent",
        "content": "¡Hola! Sí, dentro de tu portal de cliente de TAG Markets encontrarás una sección de 'Comercio Social'. Allí puedes ver a diferentes traders y conectar tu cuenta para copiar sus operaciones automáticamente."
      },
      {
        "role": "customer",
        "content": "y eso tiene costo? como elijo a quien copiar?"
      },
      {
        "role": "agent",
        "content": "El uso de la plataforma de copy trading no tiene un costo adicional, pero cada trader (proveedor de estrategia) puede establecer una comisión sobre las ganancias que generes copiándolo. En el panel podrás ver el historial de rendimiento, el nivel de riesgo y las condiciones de cada uno para que elijas el que mejor se adapte a tu perfil."
      },
      {
        "role": "customer",
        "content": "y yo podria ser un trader para que me copien?"
      },
      {
        "role": "agent",
        "content": "Sí, también es posible. Para convertirte en un proveedor de estrategia, debes cumplir con ciertos requisitos de rendimiento y consistencia. Te recomiendo que contactes al equipo de soporte a través de un ticket en tu portal para que te expliquen el proceso de aplicación en detalle."
      }
    ],
    "outcome": "success",
    "notes": "User asks about both using and providing copy trading services. The bot explains the basics and directs to support for the more complex part."
  },
  {
    "id": "conv_011",
    "scenario": "IB/referral program inquiries",
    "category": "complex",
    "messages": [
      {
        "role": "customer",
        "content": "buenas, ustedes tienen programa de referidos o para IBs?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Sí, tenemos un programa de Afiliados (Introducing Broker). Ganas comisiones por el volumen de operaciones (lotaje) que generen los clientes que refieras a TAG Markets."
      },
      {
        "role": "customer",
        "content": "y como funciona? que comisiones pagan?"
      },
      {
        "role": "agent",
        "content": "Recibes una comisión por cada lote operado por tus referidos. Las tasas varían según el volumen total que generen tus clientes. Para obtener tu enlace de referido y ver el panel de comisiones detallado, primero debes tener una cuenta activa con nosotros. Una vez registrado, en tu portal encontrarás la sección de 'Afiliados' con toda la información."
      },
      {
        "role": "customer",
        "content": "ok, entonces primero abro una cuenta normal y de ahi saco el link. gracias"
      }
    ],
    "outcome": "success",
    "notes": "Bot provides clear information about the IB program and the necessary first step."
  },
  {
    "id": "conv_012",
    "scenario": "User asks about tradable assets",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "Hola, que mercados se pueden operar con ustedes?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Con TAG Markets puedes operar una amplia variedad de mercados:\n\n- Forex (pares mayores, menores y exóticos)\n- Criptomonedas (como BTC, ETH)\n- Índices Bursátiles (como US30, Nasdaq100)\n- Metales (Oro, Plata)\n- Acciones (de las principales empresas de EE.UU.)\n\nLo único que no operamos son índices sintéticos ni opciones binarias."
      },
      {
        "role": "customer",
        "content": "Perfecto, operan el Nasdaq?"
      },
      {
        "role": "agent",
        "content": "Sí, claro. Lo encuentras en la plataforma MT5 como USTEC o similar, dependiendo de la nomenclatura."
      },
      {
        "role": "customer",
        "content": "excelente, gracias."
      }
    ],
    "outcome": "success",
    "notes": "Straightforward information request about available markets."
  },
  {
    "id": "conv_013",
    "scenario": "User is concerned about legitimacy",
    "category": "edge_case",
    "messages": [
      {
        "role": "customer",
        "content": "hola, me interesa pero como se que no son una estafa? hay muchos brokers que no pagan"
      },
      {
        "role": "agent",
        "content": "Entiendo completamente tu preocupación, la seguridad es lo más importante. TAG Markets es un broker legalmente constituido y regulado. Estamos constituidos en Mauricio y regulados por la FSC (Financial Services Commission)."
      },
      {
        "role": "agent",
        "content": "Puedes verificar nuestra licencia directamente en el registro público de la FSC aquí: [LINK_REGULACION]. Además, te invito a que leas las reseñas de nuestros clientes en Trustpilot para que conozcas sus experiencias: [LINK_TRUSTPILOT]"
      },
      {
        "role": "customer",
        "content": "ok voy a revisar los links. gracias por la transparencia"
      }
    ],
    "outcome": "success",
    "notes": "Bot addresses a common fear by providing concrete proof of regulation and social proof."
  },
  {
    "id": "conv_014",
    "scenario": "Login issue requiring escalation",
    "category": "deviation",
    "messages": [
      {
        "role": "customer",
        "content": "ayuda no puedo entrar a mi cuenta, dice que la contraseña es incorrecta pero estoy seguro que es esa"
      },
      {
        "role": "agent",
        "content": "Hola, lamento que estés teniendo problemas para ingresar. Lo primero que te sugiero es usar la opción '¿Olvidaste tu contraseña?' en la página de inicio de sesión para restablecerla. Asegúrate de revisar tu carpeta de spam si no recibes el correo."
      },
      {
        "role": "customer",
        "content": "ya lo hice 3 veces y sigue sin funcionar, me dice error"
      },
      {
        "role": "agent",
        "content": "Entiendo. En ese caso, parece ser un problema que necesita revisión técnica. Por favor, envíame tu correo electrónico para escalar el caso al equipo de soporte. Ellos revisarán tu cuenta y se pondrán en contacto contigo para solucionarlo."
      },
      {
        "role": "customer",
        "content": "ok mi correo es este jtrader@mail.com"
      }
    ],
    "outcome": "escalation",
    "notes": "Bot attempts basic troubleshooting before escalating to the appropriate team."
  },
  {
    "id": "conv_015",
    "scenario": "Quick question about minimum withdrawal",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "cuanto es lo minimo que puedo retirar?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Puedes realizar retiros a partir de 10 USD. No hay un monto máximo para retirar tus ganancias."
      },
      {
        "role": "customer",
        "content": "ok gracias"
      }
    ],
    "outcome": "success",
    "notes": "Short and direct answer to a common question."
  },
  {
    "id": "conv_016",
    "scenario": "User asks about platform and commissions",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "Buenas, en que plataforma se opera y que comisiones cobran?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Operamos en la plataforma MetaTrader 5 (MT5), que es el estándar de la industria. En cuanto a las comisiones, para nuestras cuentas apalancadas X12, cobramos una comisión fija de $1 por cada 0.1 lotes operados. Nuestros spreads son muy competitivos, desde 0.2 pips."
      },
      {
        "role": "customer",
        "content": "ok y el spread del oro como es?"
      },
      {
        "role": "agent",
        "content": "El spread del oro (XAUUSD) es variable, pero suele ser muy ajustado. Puedes verlo en tiempo real directamente en la plataforma MT5 abriendo una cuenta demo con nosotros si lo deseas."
      },
      {
        "role": "customer",
        "content": "vale gracias"
      }
    ],
    "outcome": "success",
    "notes": "User asks specific questions about trading conditions."
  },
  {
    "id": "conv_017",
    "scenario": "User asks for help with trading strategy",
    "category": "deviation",
    "messages": [
      {
        "role": "customer",
        "content": "hola ya deposite, me pueden ayudar con las operaciones? o darme alguna señal?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Bienvenido a TAG Markets. Es importante aclarar que nosotros somos el broker, es decir, te proporcionamos la plataforma y la liquidez para que operes en los mercados. No ofrecemos asesoramiento de inversión ni señales de trading."
      },
      {
        "role": "agent",
        "content": "Tú eres responsable de tus propias decisiones de trading. Sin embargo, en tu portal de cliente tienes acceso a una sección de 'Academia' con material educativo que puede ayudarte a pulir tu estrategia, y también la opción de 'Comercio Social' para seguir a otros traders."
      },
      {
        "role": "customer",
        "content": "ah ok, entiendo. somos un broker no academia. gracias"
      }
    ],
    "outcome": "success",
    "notes": "Bot clarifies its role and manages user expectations, pointing to available resources."
  },
  {
    "id": "conv_018",
    "scenario": "Account type comparison request",
    "category": "complex",
    "messages": [
      {
        "role": "customer",
        "content": "Que diferencia hay entre esta cuenta x12 y una cuenta de fondeo normal?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Excelente pregunta. Hay diferencias clave:\n\n1.  **Sin Pruebas:** Con nuestra cuenta X12, depositas y recibes tu capital apalancado al instante. No necesitas pasar ninguna prueba o desafío de evaluación.\n2.  **Reparto de Ganancias:** En las cuentas de fondeo, sueles compartir un porcentaje de tus ganancias (ej. 80/20). Con nosotros, el 100% de las ganancias es tuyo.\n3.  **Reglas:** Las empresas de fondeo suelen tener reglas más estrictas, como límite de pérdida diaria y drawdown dinámico. Nuestra única regla es el drawdown estático del 10% sobre el capital inicial, sin límite de tiempo ni de pérdida diaria."
      },
      {
        "role": "customer",
        "content": "wow es mucho mejor entonces. no hay reglas ocultas?"
      },
      {
        "role": "agent",
        "content": "No hay reglas ocultas. Es un modelo de apalancamiento directo. La única condición es la regla del 10% de drawdown. Es ideal para traders rentables que no quieren pasar por el proceso de evaluación de las pruebas de fondeo."
      }
    ],
    "outcome": "success",
    "notes": "Bot effectively highlights the product's unique selling propositions compared to a common alternative."
  },
  {
    "id": "conv_019",
    "scenario": "Simple greeting and product info request",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "Hablar con un Agente"
      },
      {
        "role": "agent",
        "content": "¡Hola! Soy [BOT_NAME], tu asistente de TAG Markets. Veo que tienes interés en una cuenta apalancada. ¿Te gustaría que te envíe la información completa de cómo funcionan?"
      },
      {
        "role": "customer",
        "content": "si porfavor"
      },
      {
        "role": "agent",
        "content": "Con gusto. Nuestras Cuentas Apalancadas X12 te permiten operar con un capital 12 veces mayor al que depositas...\n\n[...Se inserta el bloque de información estándar...]"
      }
    ],
    "outcome": "success",
    "notes": "Very common entry point. Bot responds to the generic request and proactively offers the core product information."
  },
  {
    "id": "conv_020",
    "scenario": "User asks if they can deposit more later",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "Si empiezo con una cuenta de 100, despues puedo meterle mas dinero para hacerla mas grande?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Sí, por supuesto. Puedes agregar fondos a tu cuenta en cualquier momento. Cada nuevo depósito que hagas también se amplificará x12 y se sumará a tu capital de trading. También puedes usar tus propias ganancias para amplificarlas."
      },
      {
        "role": "customer",
        "content": "genial gracias"
      }
    ],
    "outcome": "success",
    "notes": "Addresses a common question about account scalability."
  },
  {
    "id": "conv_021",
    "scenario": "User asks about using EAs/Bots",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "se pueden usar bots o asesores expertos?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Sí, en nuestras cuentas apalancadas permitimos el uso de Asesores Expertos (EAs) y bots de trading sin restricciones. También puedes hacer scalping, swing trading u operar durante noticias."
      },
      {
        "role": "customer",
        "content": "perfecto era lo q necesitaba saber"
      }
    ],
    "outcome": "success",
    "notes": "A specific rule clarification that is important for a segment of advanced traders."
  },
  {
    "id": "conv_022",
    "scenario": "Spam message",
    "category": "edge_case",
    "messages": [
      {
        "role": "customer",
        "content": "🔥 GANA $500 DIARIOS DESDE TU CELULAR, PREGÚNTAME CÓMO 🔥"
      },
      {
        "role": "agent",
        "content": "Hola, te comunicas con el canal de soporte de TAG Markets. Si tienes alguna consulta sobre nuestros servicios de trading, estaré encantado de ayudarte."
      }
    ],
    "outcome": "dropout",
    "notes": "Bot identifies a message as likely spam/unrelated advertising and responds with a neutral, standard greeting, ignoring the spam content."
  },
  {
    "id": "conv_023",
    "scenario": "Withdrawal delay escalation",
    "category": "deviation",
    "messages": [
      {
        "role": "customer",
        "content": "Hice un retiro ayer y todavia no me llega a mi wallet de binance. que pasa?"
      },
      {
        "role": "agent",
        "content": "Hola, lamento la demora. Los retiros en cripto suelen ser rápidos, pero a veces pueden tardar unas horas en ser procesados y confirmados en la blockchain. Para poder verificar el estado de tu retiro, por favor, crea un ticket en la sección de 'Apoyo' dentro de tu portal de cliente, incluyendo el ID de la transacción. El equipo de finanzas lo revisará de inmediato."
      },
      {
        "role": "customer",
        "content": "Ugh, ok. pense que era automatico. ya pongo el ticket."
      }
    ],
    "outcome": "escalation",
    "notes": "Bot manages expectations about withdrawal times and provides the correct procedure for escalating a delay."
  },
  {
    "id": "conv_024",
    "scenario": "User asks about company location",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "ustedes de donde son? tienen oficinas en colombia?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Nuestra empresa está constituida en Mauricio, donde estamos regulados. Tenemos nuestra oficina principal en Dubái y contamos con una sede administrativa en Medellín, Colombia."
      },
      {
        "role": "customer",
        "content": "Ah que bien que esten en medellin. gracias"
      }
    ],
    "outcome": "success",
    "notes": "Simple informational query building trust with local presence."
  },
  {
    "id": "conv_025",
    "scenario": "User asks about profit share again",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "ok ya entendi lo del apalancamiento. pero que porcentaje de las ganancias se quedan ustedes?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Esa es una de las mejores partes de nuestro modelo: no hay reparto de ganancias. El 100% de los profits que generes en tu cuenta son para ti. Nosotros obtenemos nuestros ingresos de las comisiones por operación."
      },
      {
        "role": "customer",
        "content": "en serio? 100% para mi? excelente"
      }
    ],
    "outcome": "success",
    "notes": "Reinforcing a key selling point."
  },
  {
    "id": "conv_026",
    "scenario": "User asks about MT5 setup after deposit",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "Listo ya hice el deposito y ya me sale el saldo x12 en el portal. ahora que hago?"
      },
      {
        "role": "agent",
        "content": "¡Excelente! El siguiente paso es conectar tu cuenta a MetaTrader 5. Deberías haber recibido un correo con tus credenciales (número de cuenta y contraseña). Abre MT5, busca el servidor 'Tagmarkets-ltd', e ingresa esos datos. Asegúrate de usar la 'Master Password', no la 'Investor Password'."
      },
      {
        "role": "customer",
        "content": "listo ya entre. ya puedo operar. gracias por la ayuda"
      },
      {
        "role": "agent",
        "content": "¡Perfecto! Bienvenido a TAG Markets. ¡Mucho éxito en tu trading!"
      }
    ],
    "outcome": "success",
    "notes": "Post-deposit support, guiding the user through the final step of setup."
  },
  {
    "id": "conv_027",
    "scenario": "User is a beginner but insists",
    "category": "deviation",
    "messages": [
      {
        "role": "customer",
        "content": "hola, no tengo experiencia pero quiero empezar con la cuenta de 100"
      },
      {
        "role": "agent",
        "content": "Hola, gracias por tu interés. Es importante que sepas que el trading con apalancamiento es de alto riesgo y no se recomienda para principiantes. Podrías perder tu depósito rápidamente. Te sugerimos firmemente que primero consideres formarte en una academia."
      },
      {
        "role": "customer",
        "content": "si si ya se el riesgo, pero quiero intentarlo. puedo abrir la cuenta o no?"
      },
      {
        "role": "agent",
        "content": "Entendemos. Como cliente, tienes la libertad de abrir una cuenta. Sin embargo, nuestro deber es informarte de los riesgos. Si decides continuar, puedes registrarte en el siguiente enlace. Por favor, opera con mucha precaución y considera empezar en una cuenta demo. [LINK_REGISTRO]"
      }
    ],
    "outcome": "success",
    "notes": "Bot gives the mandatory risk warning but allows the user to proceed after they acknowledge the risk, which is a realistic scenario."
  },
  {
    "id": "conv_028",
    "scenario": "User asks a question in English",
    "category": "edge_case",
    "messages": [
      {
        "role": "customer",
        "content": "Hello, what is the minimum deposit?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Nuestro canal de soporte principal es en español. Con gusto te respondo: el depósito mínimo es de 100 dólares para obtener una cuenta apalancada de 1,200 dólares. (Hello! Our main support channel is in Spanish. I'd be happy to answer: the minimum deposit is $100 to get a $1,200 leveraged account.)"
      }
    ],
    "outcome": "success",
    "notes": "Bot responds primarily in Spanish but provides a translation to be helpful, guiding the user to the primary language of service."
  },
  {
    "id": "conv_029",
    "scenario": "User is confused by MT5 'read-only' account",
    "category": "deviation",
    "messages": [
      {
        "role": "customer",
        "content": "ayuda conecte mi cuenta a mt5 pero me dice solo lectura y no me deja abrir operaciones"
      },
      {
        "role": "agent",
        "content": "¡Hola! Ese problema ocurre cuando inicias sesión con la 'Contraseña de Inversor' (Investor Password) en lugar de la 'Contraseña Maestra' (Master Password)."
      },
      {
        "role": "agent",
        "content": "Por favor, elimina la cuenta de tu MT5 y vuelve a agregarla, pero esta vez asegúrate de copiar y pegar la contraseña que en tu correo de credenciales aparece como 'Master Password'. Con eso deberías poder operar sin problemas."
      },
      {
        "role": "customer",
        "content": "ahhh ok, tienes razon. ya lo cambio gracias"
      }
    ],
    "outcome": "success",
    "notes": "A very common technical support issue that the bot can easily solve without escalation."
  },
  {
    "id": "conv_030",
    "scenario": "User asks about payment methods",
    "category": "happy_path",
    "messages": [
      {
        "role": "customer",
        "content": "como puedo depositar? aceptan paypal?"
      },
      {
        "role": "agent",
        "content": "¡Hola! Tenemos varios métodos de depósito. Los más rápidos son con tarjeta de crédito/débito y criptomonedas (USDT). También aceptamos transferencias bancarias locales en algunos países a través de PSE, aunque este método puede tardar 24 horas en reflejarse. Por el momento, no aceptamos PayPal directamente."
      },
      {
        "role": "customer",
        "content": "ok, lo hare con cripto entonces. gracias"
      }
    ],
    "outcome": "success",
    "notes": "Clear and concise information about available payment options."
  }
]